USE airport;
insert into Airport_City ( Назва, Місце_Розташування, Кількість_Смуг, Кількість_Терміналів ) values (' «Львів» ім. Д.Галицького','Львів, Україна', 1, 2);
insert into Airport_City ( Назва, Місце_Розташування, Кількість_Смуг, Кількість_Терміналів ) values 
('Аеропорт імені Гартсфілда-Джексона','Атланта, США', 5, 3);
insert into Airport_City ( Назва, Місце_Розташування, Кількість_Смуг, Кількість_Терміналів ) values 
('Аеропорт імені Фридерика Шопена','Варшава, Польща', 2, 2);
insert into Airport_City ( Назва, Місце_Розташування, Кількість_Смуг, Кількість_Терміналів ) values 
('Міжнародний аеропорт «Бориспіль»', 'Бориспіль, Україна', 2, 4);
insert into Airport_City ( Назва, Місце_Розташування, Кількість_Смуг, Кількість_Терміналів ) values 
('Міжнародний аеропорт Шоуду', 'Пекін, Китай', 3, 3);

insert into Company (ID_Компанії, Назва_Компанії, Кількість_Літаків) values ('CO/COA', 'Continental Airlines', 335),
 ('DL/DAL', 'Delta Air Lines', 743),
 ('FR/RYR', 'Ryanair', 457),
 ('PS/AUI', 'Ukraine International Airlines', 39),
 ('TK/THY', 'Turkish Airlines', 326);
 
 insert into Personnel (Досвід_Роботи, Імя, Посада, Прізвище, Код_Рейсу, Код_Персоналу) values
(3, 'Денис', 'Перший пілот', 'Аксьонов', 'FR-5407', '01032000D'),
(6, 'Богдан', 'Другий пілот', 'Степан', 'FR-5407', '01102001B'),
(1, 'Орест', 'Перший пілот', 'Лейко', 'DL-9473', '01102001O'),
(0, 'Степан', 'Бортпровідник', 'Тчинецький', 'DL-9473', '08012001S'),
(1, 'Соломія', 'Бортпровідниця', 'Камінська', 'FR-5407', '10112001S'),
(2, 'Олег', 'Другий пілот', 'Волошинський', 'PS-34', '16032001O'),
(2, 'Данило', 'Перший пілот', 'Іванчишин', 'PS-34', '16042001D'),
(2, 'Мирослав', 'Другий пілот', 'Коник', 'DL-9473', '18042001M'),
(1, 'Андріан', 'Бортпровідник', 'Кожомін', 'PS-34', '23102000A');

insert into Flight (Місце_Вильоту, Місце_Посадки, Код_Рейсу, ID_Компанії) values
('Міжнародний аеропорт Шоуду', 'Аеропорт імені Гартсфілда-Джексона', 'DL-9473', 'DL/DAL'),
('Міжнародний аеропорт Шоуду', 'Міжнародний аеропорт «Бориспіль»', 'FR-5407', 'FR/RYR');

insert into plane(Номер_Літака, Дата_Випуску, Кількість_Пасажирів, Кількість_Персоналу, Назва) VALUES
('12a', '2020-01-01', 180, 4, 'Boeing 737'),
('12b', '2010-01-01', 120, 3, 'Embraer 170'),
('12c', '2015-02-01', 189, 4, 'Boeing 737-800');

insert into Ticket_Sales (Код_Продажу, Код_Рейсу, Дата, Прізвище, Імя, Ціна) values
('G3FF4GO1LQ', 'DL-9473', '2020-04-02', 'Хованський', 'Юрій', 67),
('JFLSP8FAF8A', 'FR-5407', '2020-12-09', 'Степан', 'Богдан', 5365),
('LFA25J5LF15', 'FR-5407', '2020-05-09', 'Порошенко', 'Петро', 396),
('HFA44G5LF15', 'DL-9473', '2020-09-09', 'Гладун', 'Олександр', 694);


SELECT flight.Код_Рейсу, ticket_sales.Імя, ticket_sales.Прізвище, company.Назва_Компанії
FROM ticket_sales INNER JOIN (flight INNER JOIN company)
ON flight.ID_Компанії = company.ID_Компанії
AND ticket_sales.Код_Рейсу = flight.Код_Рейсу;